# 36. 有效的数独
# 中等
#
# 相关标签
# 相关企业
# 请你判断一个 9 x 9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。
#
# 数字 1-9 在每一行只能出现一次。
# 数字 1-9 在每一列只能出现一次。
# 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）
#
#
# 注意：
#
# 一个有效的数独（部分已被填充）不一定是可解的。
# 只需要根据以上规则，验证已经填入的数字是否有效即可。
# 空白格用 '.' 表示。
#
#
# 示例 1：
#
#
# 输入：board =
# [["5","3",".",".","7",".",".",".","."]
#     ,["6",".",".","1","9","5",".",".","."]
#     ,[".","9","8",".",".",".",".","6","."]
#     ,["8",".",".",".","6",".",".",".","3"]
#     ,["4",".",".","8",".","3",".",".","1"]
#     ,["7",".",".",".","2",".",".",".","6"]
#     ,[".","6",".",".",".",".","2","8","."]
#     ,[".",".",".","4","1","9",".",".","5"]
#     ,[".",".",".",".","8",".",".","7","9"]]
# 输出：true
# 示例 2：
#
# 输入：board =
# [["8","3",".",".","7",".",".",".","."]
#     ,["6",".",".","1","9","5",".",".","."]
#     ,[".","9","8",".",".",".",".","6","."]
#     ,["8",".",".",".","6",".",".",".","3"]
#     ,["4",".",".","8",".","3",".",".","1"]
#     ,["7",".",".",".","2",".",".",".","6"]
#     ,[".","6",".",".",".",".","2","8","."]
#     ,[".",".",".","4","1","9",".",".","5"]
#     ,[".",".",".",".","8",".",".","7","9"]]
# 输出：false
# 解释：除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。 但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无效的。
#
#
# 提示：
#
# board.length == 9
# board[i].length == 9
# board[i][j] 是一位数字（1-9）或者 '.'

# 可以增加程序运行所需内存 一次🏪二维数组来实现 判断属于哪个Box: j/3 + (i/3)*3ß
from typing import List
class Solution:
    def isValidSudoku(self, board: List[List[str]]) -> bool:
        if not board:
            return False
        rows = len(board)
        cols = len(board[0])
        # 每行不能重复
        for row in range(rows):
            mark = [False] * 9
            for col in range(cols):
                val = board[row][col]
                idx = ord(val) - ord('1')
                if val == '.':
                    continue
                elif mark[idx]:
                    return False
                else:
                    mark[idx] = True

        # 每列不能重复
        for col in range(cols):
            mark = [False] * 9
            for row in range(rows):
                val = board[row][col]
                idx = ord(val) - ord('1')
                if val == '.':
                    continue
                elif mark[idx]:
                    return False
                else:
                    mark[idx] = True

        step_arr = [[-1, -1], [-1, 0], [-1, 1], [0, -1], [0, 0], [0, 1], [1, -1], [1, 0], [1, 1]]
        # 每个九宫格不能重复
        for row in range(1, rows, 3):
            for col in range(1, cols, 3):
                mark = [False] * 9
                for step in step_arr:
                    val = board[row+step[0]][col+step[1]]
                    idx = ord(val) - ord('1')
                    if val == '.':
                        continue
                    elif mark[idx]:
                        return False
                    else:
                        mark[idx] = True

        return True



if __name__ == '__main__':
    board = [["5","3",".",".","7",".",".",".","."]
    ,["6",".",".","1","9","5",".",".","."]
    ,[".","9","8",".",".",".",".","6","."]
    ,["8",".",".",".","6",".",".",".","3"]
    ,["4",".",".","8",".","3",".",".","1"]
    ,["7",".",".",".","2",".",".",".","6"]
    ,[".","6",".",".",".",".","2","8","."]
    ,[".",".",".","4","1","9",".",".","5"]
    ,[".",".",".",".","8",".",".","7","9"]]
    solution = Solution()
    print(solution.isValidSudoku(board))